# ConnectionInputPoint Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectionInputPoint Constructor
ConnectionInputPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ConnectionInputPoint()()()() | Construct a default input point. |
| ConnectionInputPoint(XYZ) | Construct an input point from 3d point. A new valid id will be auto-generated. |
| ConnectionInputPoint(XYZ, Guid) | Construct an input point from 3d point and id. |

# See Also
ConnectionInputPoint Class
ConnectionInputPoint Members
Autodesk.Revit.DB.Structure Namespace